Autodesk.Revit.UI.Selection.ISelectionFilter.AllowElement(Autodesk.Revit.DB.Element)
Override this pre-filter method to specify if the element should be permitted to be selected.
Returns: Return true to allow the user to select this candidate element. Return false to prevent selection of this element.
elem: A candidate element in selection operation.
Remarks: If an exception is thrown from this method, the element will not be permitted to be selected.